OpenFOAM-10/chapter2/ellipsoidal/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
);

regions
(
    sphereToCell
    {
        centre (0 0 0.008);
        radius 0.004;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
    /*cylinderToCell
    {
        point1 (0 0 0.008);
        point2 (0 0 0.008);
        radius 0.004;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }
    boxToCell
    {
        box (0 0 0.008)(0 0 0.008);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
        );
    }*/
);


// ************************************************************************* //
